[ :ref:`aws <cli:aws>` . :ref:`dlm <cli:aws dlm>` ]

.. _cli:aws dlm delete-lifecycle-policy:


***********************
delete-lifecycle-policy
***********************



===========
Description
===========



Deletes the specified lifecycle policy and halts the automated operations that the policy specified.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/dlm-2018-01-12/DeleteLifecyclePolicy>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    delete-lifecycle-policy
  --policy-id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--policy-id`` (string)


  The identifier of the lifecycle policy.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To delete a lifecycle policy**

The following example deletes the specified lifecycle policy.::

  aws dlm delete-lifecycle-policy --policy-id policy-0123456789abcdef0


======
Output
======

