[ :ref:`aws <cli:aws>` . :ref:`sagemaker <cli:aws sagemaker>` ]

.. _cli:aws sagemaker delete-notebook-instance-lifecycle-config:


*****************************************
delete-notebook-instance-lifecycle-config
*****************************************



===========
Description
===========



Deletes a notebook instance lifecycle configuration.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/sagemaker-2017-07-24/DeleteNotebookInstanceLifecycleConfig>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    delete-notebook-instance-lifecycle-config
  --notebook-instance-lifecycle-config-name <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--notebook-instance-lifecycle-config-name`` (string)


  The name of the lifecycle configuration to delete.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


======
Output
======

None