[ :ref:`aws <cli:aws>` . :ref:`directconnect <cli:aws directconnect>` ]

.. _cli:aws directconnect allocate-hosted-connection:


**************************
allocate-hosted-connection
**************************



===========
Description
===========



Creates a hosted connection on the specified interconnect or a link aggregation group (LAG).

 

Allocates a VLAN number and a specified amount of bandwidth for use by a hosted connection on the specified interconnect or LAG.

 

.. note::

   

  Intended for use by AWS Direct Connect partners only.

   



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/directconnect-2012-10-25/AllocateHostedConnection>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    allocate-hosted-connection
  --connection-id <value>
  --owner-account <value>
  --bandwidth <value>
  --connection-name <value>
  --vlan <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--connection-id`` (string)


  The ID of the interconnect or LAG.

  

``--owner-account`` (string)


  The ID of the AWS account ID of the customer for the connection.

  

``--bandwidth`` (string)


  The bandwidth of the hosted connection, in Mbps. The possible values are 50Mbps, 100Mbps, 200Mbps, 300Mbps, 400Mbps, and 500Mbps.

  

``--connection-name`` (string)


  The name of the hosted connection.

  

``--vlan`` (integer)


  The dedicated VLAN provisioned to the hosted connection.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To create a hosted connection on an interconnect**

The following example creates a hosted connection on the specified interconnect.

Command::

  aws directconnect allocate-hosted-conection --bandwidth 500Mbps --connection-name mydcinterconnect --owner-account 123456789012 --connection-id dxcon-fgktov66 --vlan 101

Output::

  {
      "partnerName": "TIVIT", 
      "vlan": 101, 
      "ownerAccount": "123456789012", 
      "connectionId": "dxcon-ffzc51m1", 
      "connectionState": "ordering", 
      "bandwidth": "500Mbps", 
      "location": "TIVIT", 
      "connectionName": "mydcinterconnect", 
      "region": "sa-east-1"
  }

======
Output
======

ownerAccount -> (string)

  

  The ID of the AWS account that owns the connection.

  

  

connectionId -> (string)

  

  The ID of the connection.

  

  

connectionName -> (string)

  

  The name of the connection.

  

  

connectionState -> (string)

  

  The state of the connection. The following are the possible values:

   

   
  * ``ordering`` : The initial state of a hosted connection provisioned on an interconnect. The connection stays in the ordering state until the owner of the hosted connection confirms or declines the connection order. 
   
  * ``requested`` : The initial state of a standard connection. The connection stays in the requested state until the Letter of Authorization (LOA) is sent to the customer. 
   
  * ``pending`` : The connection has been approved and is being initialized. 
   
  * ``available`` : The network link is up and the connection is ready for use. 
   
  * ``down`` : The network link is down. 
   
  * ``deleting`` : The connection is being deleted. 
   
  * ``deleted`` : The connection has been deleted. 
   
  * ``rejected`` : A hosted connection in the ``ordering`` state enters the ``rejected`` state if it is deleted by the customer. 
   

  

  

region -> (string)

  

  The AWS Region where the connection is located.

  

  

location -> (string)

  

  The location of the connection.

  

  

bandwidth -> (string)

  

  The bandwidth of the connection.

  

  

vlan -> (integer)

  

  The ID of the VLAN.

  

  

partnerName -> (string)

  

  The name of the AWS Direct Connect service provider associated with the connection.

  

  

loaIssueTime -> (timestamp)

  

  The time of the most recent call to  DescribeLoa for this connection.

  

  

lagId -> (string)

  

  The ID of the LAG.

  

  

awsDevice -> (string)

  

  The Direct Connect endpoint on which the physical connection terminates.

  

  

jumboFrameCapable -> (boolean)

  

  Indicates whether jumbo frames (9001 MTU) are supported.

  

  

awsDeviceV2 -> (string)

  

  The Direct Connect endpoint on which the physical connection terminates.

  

  

