[ :ref:`aws <cli:aws>` . :ref:`directconnect <cli:aws directconnect>` ]

.. _cli:aws directconnect confirm-private-virtual-interface:


*********************************
confirm-private-virtual-interface
*********************************



===========
Description
===========



Accepts ownership of a private virtual interface created by another AWS account.

 

After the virtual interface owner makes this call, the virtual interface is created and attached to the specified virtual private gateway or Direct Connect gateway, and is made available to handle traffic.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/directconnect-2012-10-25/ConfirmPrivateVirtualInterface>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    confirm-private-virtual-interface
  --virtual-interface-id <value>
  [--virtual-gateway-id <value>]
  [--direct-connect-gateway-id <value>]
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--virtual-interface-id`` (string)


  The ID of the virtual interface.

  

``--virtual-gateway-id`` (string)


  The ID of the virtual private gateway.

  

``--direct-connect-gateway-id`` (string)


  The ID of the Direct Connect gateway.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To accept ownership of a private virtual interface**

The following ``confirm-private-virtual-interface`` command accepts ownership of a private virtual interface created by another customer::

  aws directconnect confirm-private-virtual-interface --virtual-interface-id dxvif-fgy8orxu --virtual-gateway-id vgw-e4a47df9

Output::

  {
      "virtualInterfaceState": "pending"
  }

======
Output
======

virtualInterfaceState -> (string)

  

  The state of the virtual interface. The following are the possible values:

   

   
  * ``confirming`` : The creation of the virtual interface is pending confirmation from the virtual interface owner. If the owner of the virtual interface is different from the owner of the connection on which it is provisioned, then the virtual interface will remain in this state until it is confirmed by the virtual interface owner. 
   
  * ``verifying`` : This state only applies to public virtual interfaces. Each public virtual interface needs validation before the virtual interface can be created. 
   
  * ``pending`` : A virtual interface is in this state from the time that it is created until the virtual interface is ready to forward traffic. 
   
  * ``available`` : A virtual interface that is able to forward traffic. 
   
  * ``down`` : A virtual interface that is BGP down. 
   
  * ``deleting`` : A virtual interface is in this state immediately after calling  DeleteVirtualInterface until it can no longer forward traffic. 
   
  * ``deleted`` : A virtual interface that cannot forward traffic. 
   
  * ``rejected`` : The virtual interface owner has declined creation of the virtual interface. If a virtual interface in the ``Confirming`` state is deleted by the virtual interface owner, the virtual interface enters the ``Rejected`` state. 
   

  

  

