[ :ref:`aws <cli:aws>` . :ref:`directconnect <cli:aws directconnect>` ]

.. _cli:aws directconnect delete-direct-connect-gateway-association:


*****************************************
delete-direct-connect-gateway-association
*****************************************



===========
Description
===========



Deletes the association between the specified Direct Connect gateway and virtual private gateway.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/directconnect-2012-10-25/DeleteDirectConnectGatewayAssociation>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    delete-direct-connect-gateway-association
  --direct-connect-gateway-id <value>
  --virtual-gateway-id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--direct-connect-gateway-id`` (string)


  The ID of the Direct Connect gateway.

  

``--virtual-gateway-id`` (string)


  The ID of the virtual private gateway.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To delete a Direct Connect gateway association**

The following example disassociates virtual private gateway ``vgw-6efe725e`` from Direct Connect gateway ``5f294f92-bafb-4011-916d-9b0bexample``.

Command::

  aws directconnect delete-direct-connect-gateway-association --direct-connect-gateway-id 5f294f92-bafb-4011-916d-9b0bexample --virtual-gateway-id vgw-6efe725e

Output::

  {
    "directConnectGatewayAssociation": {
        "associationState": "disassociating", 
        "virtualGatewayOwnerAccount": "123456789012", 
        "directConnectGatewayId": "5f294f92-bafb-4011-916d-9b0bexample", 
        "virtualGatewayId": "vgw-6efe725e", 
        "virtualGatewayRegion": "us-east-2"
    }
  }

======
Output
======

directConnectGatewayAssociation -> (structure)

  

  The association to be deleted.

  

  directConnectGatewayId -> (string)

    

    The ID of the Direct Connect gateway.

    

    

  virtualGatewayId -> (string)

    

    The ID of the virtual private gateway. Applies only to private virtual interfaces.

    

    

  virtualGatewayRegion -> (string)

    

    The AWS Region where the virtual private gateway is located.

    

    

  virtualGatewayOwnerAccount -> (string)

    

    The ID of the AWS account that owns the virtual private gateway.

    

    

  associationState -> (string)

    

    The state of the association. The following are the possible values:

     

     
    * ``associating`` : The initial state after calling  CreateDirectConnectGatewayAssociation . 
     
    * ``associated`` : The Direct Connect gateway and virtual private gateway are successfully associated and ready to pass traffic. 
     
    * ``disassociating`` : The initial state after calling  DeleteDirectConnectGatewayAssociation . 
     
    * ``disassociated`` : The virtual private gateway is disassociated from the Direct Connect gateway. Traffic flow between the Direct Connect gateway and virtual private gateway is stopped. 
     

    

    

  stateChangeError -> (string)

    

    The error message if the state of an object failed to advance.

    

    

  

