[ :ref:`aws <cli:aws>` . :ref:`directconnect <cli:aws directconnect>` ]

.. _cli:aws directconnect describe-connections:


********************
describe-connections
********************



===========
Description
===========



Displays the specified connection or all connections in this Region.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/directconnect-2012-10-25/DescribeConnections>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    describe-connections
  [--connection-id <value>]
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--connection-id`` (string)


  The ID of the connection.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To list all connections in the current region**

The following ``describe-connections`` command lists all connections in the current region::

  aws directconnect describe-connections

Output::

  {
    "connections": [
        {
            "awsDevice": "EqDC2-123h49s71dabc", 
            "ownerAccount": "123456789012", 
            "connectionId": "dxcon-fguhmqlc", 
            "lagId": "dxlag-ffrz71kw", 
            "connectionState": "down", 
            "bandwidth": "1Gbps", 
            "location": "EqDC2", 
            "connectionName": "My_Connection", 
            "loaIssueTime": 1491568964.0, 
            "region": "us-east-1"
        }
    ]
  }


======
Output
======

connections -> (list)

  

  The connections.

  

  (structure)

    

    Information about an AWS Direct Connect connection.

    

    ownerAccount -> (string)

      

      The ID of the AWS account that owns the connection.

      

      

    connectionId -> (string)

      

      The ID of the connection.

      

      

    connectionName -> (string)

      

      The name of the connection.

      

      

    connectionState -> (string)

      

      The state of the connection. The following are the possible values:

       

       
      * ``ordering`` : The initial state of a hosted connection provisioned on an interconnect. The connection stays in the ordering state until the owner of the hosted connection confirms or declines the connection order. 
       
      * ``requested`` : The initial state of a standard connection. The connection stays in the requested state until the Letter of Authorization (LOA) is sent to the customer. 
       
      * ``pending`` : The connection has been approved and is being initialized. 
       
      * ``available`` : The network link is up and the connection is ready for use. 
       
      * ``down`` : The network link is down. 
       
      * ``deleting`` : The connection is being deleted. 
       
      * ``deleted`` : The connection has been deleted. 
       
      * ``rejected`` : A hosted connection in the ``ordering`` state enters the ``rejected`` state if it is deleted by the customer. 
       

      

      

    region -> (string)

      

      The AWS Region where the connection is located.

      

      

    location -> (string)

      

      The location of the connection.

      

      

    bandwidth -> (string)

      

      The bandwidth of the connection.

      

      

    vlan -> (integer)

      

      The ID of the VLAN.

      

      

    partnerName -> (string)

      

      The name of the AWS Direct Connect service provider associated with the connection.

      

      

    loaIssueTime -> (timestamp)

      

      The time of the most recent call to  DescribeLoa for this connection.

      

      

    lagId -> (string)

      

      The ID of the LAG.

      

      

    awsDevice -> (string)

      

      The Direct Connect endpoint on which the physical connection terminates.

      

      

    jumboFrameCapable -> (boolean)

      

      Indicates whether jumbo frames (9001 MTU) are supported.

      

      

    awsDeviceV2 -> (string)

      

      The Direct Connect endpoint on which the physical connection terminates.

      

      

    

  

