[ :ref:`aws <cli:aws>` . :ref:`directconnect <cli:aws directconnect>` ]

.. _cli:aws directconnect describe-virtual-gateways:


*************************
describe-virtual-gateways
*************************



===========
Description
===========



Lists the virtual private gateways owned by the AWS account.

 

You can create one or more AWS Direct Connect private virtual interfaces linked to a virtual private gateway.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/directconnect-2012-10-25/DescribeVirtualGateways>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    describe-virtual-gateways
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To list virtual private gateways**

The following ``describe-virtual-gateways`` command lists virtual private gateways owned by your AWS account::

  aws directconnect describe-virtual-gateways

Output::

  {
      "virtualGateways": [
          {
              "virtualGatewayId": "vgw-aba37db6", 
              "virtualGatewayState": "available"
          }
      ]
  }

======
Output
======

virtualGateways -> (list)

  

  The virtual private gateways.

  

  (structure)

    

    Information about a virtual private gateway for a private virtual interface.

    

    virtualGatewayId -> (string)

      

      The ID of the virtual private gateway.

      

      

    virtualGatewayState -> (string)

      

      The state of the virtual private gateway. The following are the possible values:

       

       
      * ``pending`` : Initial state after creating the virtual private gateway. 
       
      * ``available`` : Ready for use by a private virtual interface. 
       
      * ``deleting`` : Initial state after deleting the virtual private gateway. 
       
      * ``deleted`` : The virtual private gateway is deleted. The private virtual interface is unable to send traffic over this gateway. 
       

      

      

    

  

