[ :ref:`aws <cli:aws>` . :ref:`directconnect <cli:aws directconnect>` ]

.. _cli:aws directconnect disassociate-connection-from-lag:


********************************
disassociate-connection-from-lag
********************************



===========
Description
===========



Disassociates a connection from a link aggregation group (LAG). The connection is interrupted and re-established as a standalone connection (the connection is not deleted; to delete the connection, use the  DeleteConnection request). If the LAG has associated virtual interfaces or hosted connections, they remain associated with the LAG. A disassociated connection owned by an AWS Direct Connect partner is automatically converted to an interconnect.

 

If disassociating the connection would cause the LAG to fall below its setting for minimum number of operational connections, the request fails, except when it's the last member of the LAG. If all connections are disassociated, the LAG continues to exist as an empty LAG with no physical connections. 



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/directconnect-2012-10-25/DisassociateConnectionFromLag>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    disassociate-connection-from-lag
  --connection-id <value>
  --lag-id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--connection-id`` (string)


  The ID of the connection. For example, dxcon-abc123.

  

``--lag-id`` (string)


  The ID of the LAG. For example, dxlag-abc123.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To disassociate a connection from a LAG**

The following example disassociates the specified connection from the specified LAG.

Command::

  aws directconnect disassociate-connection-from-lag --lag-id dxlag-fhccu14t --connection-id  dxcon-fg9607vm

Output::

  {
    "ownerAccount": "123456789012", 
    "connectionId": "dxcon-fg9607vm", 
    "connectionState": "requested", 
    "bandwidth": "1Gbps", 
    "location": "EqDC2", 
    "connectionName": "Con2ForLag", 
    "region": "us-east-1"
  }


======
Output
======

ownerAccount -> (string)

  

  The ID of the AWS account that owns the connection.

  

  

connectionId -> (string)

  

  The ID of the connection.

  

  

connectionName -> (string)

  

  The name of the connection.

  

  

connectionState -> (string)

  

  The state of the connection. The following are the possible values:

   

   
  * ``ordering`` : The initial state of a hosted connection provisioned on an interconnect. The connection stays in the ordering state until the owner of the hosted connection confirms or declines the connection order. 
   
  * ``requested`` : The initial state of a standard connection. The connection stays in the requested state until the Letter of Authorization (LOA) is sent to the customer. 
   
  * ``pending`` : The connection has been approved and is being initialized. 
   
  * ``available`` : The network link is up and the connection is ready for use. 
   
  * ``down`` : The network link is down. 
   
  * ``deleting`` : The connection is being deleted. 
   
  * ``deleted`` : The connection has been deleted. 
   
  * ``rejected`` : A hosted connection in the ``ordering`` state enters the ``rejected`` state if it is deleted by the customer. 
   

  

  

region -> (string)

  

  The AWS Region where the connection is located.

  

  

location -> (string)

  

  The location of the connection.

  

  

bandwidth -> (string)

  

  The bandwidth of the connection.

  

  

vlan -> (integer)

  

  The ID of the VLAN.

  

  

partnerName -> (string)

  

  The name of the AWS Direct Connect service provider associated with the connection.

  

  

loaIssueTime -> (timestamp)

  

  The time of the most recent call to  DescribeLoa for this connection.

  

  

lagId -> (string)

  

  The ID of the LAG.

  

  

awsDevice -> (string)

  

  The Direct Connect endpoint on which the physical connection terminates.

  

  

jumboFrameCapable -> (boolean)

  

  Indicates whether jumbo frames (9001 MTU) are supported.

  

  

awsDeviceV2 -> (string)

  

  The Direct Connect endpoint on which the physical connection terminates.

  

  

