[ :ref:`aws <cli:aws>` . :ref:`codecommit <cli:aws codecommit>` ]

.. _cli:aws codecommit get-comment:


***********
get-comment
***********



===========
Description
===========



Returns the content of a comment made on a change, file, or commit in a repository.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/codecommit-2015-04-13/GetComment>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    get-comment
  --comment-id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--comment-id`` (string)


  The unique, system-generated ID of the comment. To get this ID, use  GetCommentsForComparedCommit or  GetCommentsForPullRequest .

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To view details of a comment**

This example demonstrates how to view details of a comment with the system-generated comment ID of 'ff30b348EXAMPLEb9aa670f'::

  aws codecommit get-comment --comment-id ff30b348EXAMPLEb9aa670f

Output::

  {
   "comment": { 
      "authorArn": "arn:aws:iam::111111111111:user/Li_Juan",
      "clientRequestToken": "123Example",
      "commentId": "ff30b348EXAMPLEb9aa670f",
      "content": "Whoops - I meant to add this comment to the line, but I don't see how to delete it.",
      "creationDate": 1508369768.142,
      "deleted": false,
      "commentId": "",
      "lastModifiedDate": 1508369842.278
    }
  }

======
Output
======

comment -> (structure)

  

  The contents of the comment.

  

  commentId -> (string)

    

    The system-generated comment ID.

    

    

  content -> (string)

    

    The content of the comment.

    

    

  inReplyTo -> (string)

    

    The ID of the comment for which this comment is a reply, if any.

    

    

  creationDate -> (timestamp)

    

    The date and time the comment was created, in timestamp format.

    

    

  lastModifiedDate -> (timestamp)

    

    The date and time the comment was most recently modified, in timestamp format.

    

    

  authorArn -> (string)

    

    The Amazon Resource Name (ARN) of the person who posted the comment.

    

    

  deleted -> (boolean)

    

    A Boolean value indicating whether the comment has been deleted.

    

    

  clientRequestToken -> (string)

    

    A unique, client-generated idempotency token that when provided in a request, ensures the request cannot be repeated with a changed parameter. If a request is received with the same parameters and a token is included, the request will return information about the initial request that used that token.

    

    

  

