[ :ref:`aws <cli:aws>` . :ref:`ec2 <cli:aws ec2>` ]

.. _cli:aws ec2 describe-dhcp-options:


*********************
describe-dhcp-options
*********************



===========
Description
===========



Describes one or more of your DHCP options sets.

 

For more information, see `DHCP Options Sets <http://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/VPC_DHCP_Options.html>`__ in the *Amazon Virtual Private Cloud User Guide* .



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/ec2-2016-11-15/DescribeDhcpOptions>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    describe-dhcp-options
  [--dhcp-options-ids <value>]
  [--filters <value>]
  [--dry-run | --no-dry-run]
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--dhcp-options-ids`` (list)


  The IDs of one or more DHCP options sets.

   

  Default: Describes all your DHCP options sets.

  



Syntax::

  "string" "string" ...



``--filters`` (list)


  One or more filters.

   

   
  * ``dhcp-options-id`` - The ID of a set of DHCP options. 
   
  * ``key`` - The key for one of the options (for example, ``domain-name`` ). 
   
  * ``value`` - The value for one of the options. 
   
  * ``tag`` :<key> - The key/value combination of a tag assigned to the resource. Use the tag key in the filter name and the tag value as the filter value. For example, to find all resources that have a tag with the key ``Owner`` and the value ``TeamA`` , specify ``tag:Owner`` for the filter name and ``TeamA`` for the filter value. 
   
  * ``tag-key`` - The key of a tag assigned to the resource. Use this filter to find all resources assigned a tag with a specific key, regardless of the tag value. 
   

  



Shorthand Syntax::

    Name=string,Values=string,string ...




JSON Syntax::

  [
    {
      "Name": "string",
      "Values": ["string", ...]
    }
    ...
  ]



``--dry-run`` | ``--no-dry-run`` (boolean)


  Checks whether you have the required permissions for the action, without actually making the request, and provides an error response. If you have the required permissions, the error response is ``DryRunOperation`` . Otherwise, it is ``UnauthorizedOperation`` .

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To describe your DHCP options sets**

This example describes your DHCP options sets.

Command::

  aws ec2 describe-dhcp-options

Output::

  {
      "DhcpOptions": [
          {
              "DhcpConfigurations": [
                  {
                      "Values": [
                          "10.2.5.2",
                          "10.2.5.1"
                      ],
                      "Key": "domain-name-servers"
                  }
              ],
              "DhcpOptionsId": "dopt-d9070ebb"
          },
          {
              "DhcpConfigurations": [
                  {
                      "Values": [
                          "AmazonProvidedDNS"
                      ],
                      "Key": "domain-name-servers"
                  }
              ],
              "DhcpOptionsId": "dopt-7a8b9c2d"
          }
      ]  
  }

======
Output
======

DhcpOptions -> (list)

  

  Information about one or more DHCP options sets.

  

  (structure)

    

    Describes a set of DHCP options.

    

    DhcpConfigurations -> (list)

      

      One or more DHCP options in the set.

      

      (structure)

        

        Describes a DHCP configuration option.

        

        Key -> (string)

          

          The name of a DHCP option.

          

          

        Values -> (list)

          

          One or more values for the DHCP option.

          

          (structure)

            

            Describes a value for a resource attribute that is a String.

            

            Value -> (string)

              

              The attribute value. The value is case-sensitive.

              

              

            

          

        

      

    DhcpOptionsId -> (string)

      

      The ID of the set of DHCP options.

      

      

    Tags -> (list)

      

      Any tags assigned to the DHCP options set.

      

      (structure)

        

        Describes a tag.

        

        Key -> (string)

          

          The key of the tag.

           

          Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with ``aws:`` .

          

          

        Value -> (string)

          

          The value of the tag.

           

          Constraints: Tag values are case-sensitive and accept a maximum of 255 Unicode characters.

          

          

        

      

    

  

