[ :ref:`aws <cli:aws>` . :ref:`ec2 <cli:aws ec2>` ]

.. _cli:aws ec2 describe-fpga-image-attribute:


*****************************
describe-fpga-image-attribute
*****************************



===========
Description
===========



Describes the specified attribute of the specified Amazon FPGA Image (AFI).



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/ec2-2016-11-15/DescribeFpgaImageAttribute>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    describe-fpga-image-attribute
  [--dry-run | --no-dry-run]
  --fpga-image-id <value>
  --attribute <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--dry-run`` | ``--no-dry-run`` (boolean)


  Checks whether you have the required permissions for the action, without actually making the request, and provides an error response. If you have the required permissions, the error response is ``DryRunOperation`` . Otherwise, it is ``UnauthorizedOperation`` .

  

``--fpga-image-id`` (string)


  The ID of the AFI.

  

``--attribute`` (string)


  The AFI attribute.

  

  Possible values:

  
  *   ``description``

  
  *   ``name``

  
  *   ``loadPermission``

  
  *   ``productCodes``

  

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To describe the attributes of an Amazon FPGA image**

This example describes the load permissions for the specified AFI.

Command::

  aws ec2 describe-fpga-image-attribute --fpga-image-id afi-0d123e123bfc85abc --attribute loadPermission

Output::

  {
    "FpgaImageAttribute": {
        "FpgaImageId": "afi-0d123e123bfc85abc", 
        "LoadPermissions": [
            {
                "UserId": "123456789012"
            }
        ]
    }
  }


======
Output
======

FpgaImageAttribute -> (structure)

  

  Information about the attribute.

  

  FpgaImageId -> (string)

    

    The ID of the AFI.

    

    

  Name -> (string)

    

    The name of the AFI.

    

    

  Description -> (string)

    

    The description of the AFI.

    

    

  LoadPermissions -> (list)

    

    One or more load permissions.

    

    (structure)

      

      Describes a load permission.

      

      UserId -> (string)

        

        The AWS account ID.

        

        

      Group -> (string)

        

        The name of the group.

        

        

      

    

  ProductCodes -> (list)

    

    One or more product codes.

    

    (structure)

      

      Describes a product code.

      

      ProductCodeId -> (string)

        

        The product code.

        

        

      ProductCodeType -> (string)

        

        The type of product code.

        

        

      

    

  

