[ :ref:`aws <cli:aws>` . :ref:`ec2 <cli:aws ec2>` ]

.. _cli:aws ec2 modify-vpc-endpoint:


*******************
modify-vpc-endpoint
*******************



===========
Description
===========



Modifies attributes of a specified VPC endpoint. The attributes that you can modify depend on the type of VPC endpoint (interface or gateway). For more information, see `VPC Endpoints <http://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/vpc-endpoints.html>`__ in the *Amazon Virtual Private Cloud User Guide* .



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/ec2-2016-11-15/ModifyVpcEndpoint>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    modify-vpc-endpoint
  [--dry-run | --no-dry-run]
  --vpc-endpoint-id <value>
  [--reset-policy | --no-reset-policy]
  [--policy-document <value>]
  [--add-route-table-ids <value>]
  [--remove-route-table-ids <value>]
  [--add-subnet-ids <value>]
  [--remove-subnet-ids <value>]
  [--add-security-group-ids <value>]
  [--remove-security-group-ids <value>]
  [--private-dns-enabled | --no-private-dns-enabled]
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--dry-run`` | ``--no-dry-run`` (boolean)


  Checks whether you have the required permissions for the action, without actually making the request, and provides an error response. If you have the required permissions, the error response is ``DryRunOperation`` . Otherwise, it is ``UnauthorizedOperation`` .

  

``--vpc-endpoint-id`` (string)


  The ID of the endpoint.

  

``--reset-policy`` | ``--no-reset-policy`` (boolean)


  (Gateway endpoint) Specify ``true`` to reset the policy document to the default policy. The default policy allows full access to the service.

  

``--policy-document`` (string)


  (Gateway endpoint) A policy document to attach to the endpoint. The policy must be in valid JSON format.

  

``--add-route-table-ids`` (list)


  (Gateway endpoint) One or more route tables IDs to associate with the endpoint.

  



Syntax::

  "string" "string" ...



``--remove-route-table-ids`` (list)


  (Gateway endpoint) One or more route table IDs to disassociate from the endpoint.

  



Syntax::

  "string" "string" ...



``--add-subnet-ids`` (list)


  (Interface endpoint) One or more subnet IDs in which to serve the endpoint.

  



Syntax::

  "string" "string" ...



``--remove-subnet-ids`` (list)


  (Interface endpoint) One or more subnets IDs in which to remove the endpoint.

  



Syntax::

  "string" "string" ...



``--add-security-group-ids`` (list)


  (Interface endpoint) One or more security group IDs to associate with the network interface.

  



Syntax::

  "string" "string" ...



``--remove-security-group-ids`` (list)


  (Interface endpoint) One or more security group IDs to disassociate from the network interface.

  



Syntax::

  "string" "string" ...



``--private-dns-enabled`` | ``--no-private-dns-enabled`` (boolean)


  (Interface endpoint) Indicate whether a private hosted zone is associated with the VPC.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To modify a gateway endpoint**

This example modifies gateway endpoint ``vpce-1a2b3c4d`` by associating route table ``rtb-aaa222bb`` with the endpoint, and resetting the policy document.

Command::

  aws ec2 modify-vpc-endpoint --vpc-endpoint-id vpce-1a2b3c4d --add-route-table-ids rtb-aaa222bb --reset-policy

Output::

  {
    "Return": true
  }

**To modify an interface endpoint**

This example modifies interface endpoint ``vpce-0fe5b17a0707d6fa5`` by adding subnet ``subnet-d6fcaa8d`` to the endpoint.

Command:: 

  aws ec2 modify-vpc-endpoint --vpc-endpoint-id vpce-0fe5b17a0707d6fa5 --add-subnet-id subnet-d6fcaa8d

Output::

  {
    "Return": true
  }

======
Output
======

Return -> (boolean)

  

  Returns ``true`` if the request succeeds; otherwise, it returns an error.

  

  

