[ :ref:`aws <cli:aws>` . :ref:`ec2 <cli:aws ec2>` ]

.. _cli:aws ec2 modify-vpc-tenancy:


******************
modify-vpc-tenancy
******************



===========
Description
===========



Modifies the instance tenancy attribute of the specified VPC. You can change the instance tenancy attribute of a VPC to ``default`` only. You cannot change the instance tenancy attribute to ``dedicated`` .

 

After you modify the tenancy of the VPC, any new instances that you launch into the VPC have a tenancy of ``default`` , unless you specify otherwise during launch. The tenancy of any existing instances in the VPC is not affected.

 

For more information, see `Dedicated Instances <http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/dedicated-instance.html>`__ in the *Amazon Elastic Compute Cloud User Guide* .



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/ec2-2016-11-15/ModifyVpcTenancy>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    modify-vpc-tenancy
  --vpc-id <value>
  --instance-tenancy <value>
  [--dry-run | --no-dry-run]
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--vpc-id`` (string)


  The ID of the VPC.

  

``--instance-tenancy`` (string)


  The instance tenancy attribute for the VPC. 

  

  Possible values:

  
  *   ``default``

  

  

``--dry-run`` | ``--no-dry-run`` (boolean)


  Checks whether you have the required permissions for the action, without actually making the request, and provides an error response. If you have the required permissions, the error response is ``DryRunOperation`` . Otherwise, it is ``UnauthorizedOperation`` .

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To modify the tenancy of a VPC**

This example modifies the tenancy of VPC ``vpc-1a2b3c4d`` to ``default``.

Command::

  aws ec2 modify-vpc-tenancy --vpc-id vpc-1a2b3c4d --instance-tenancy default

Output::

  {
    "Return": true
  }

======
Output
======

ReturnValue -> (boolean)

  

  Returns ``true`` if the request succeeds; otherwise, returns an error.

  

  

