[ :ref:`aws <cli:aws>` . :ref:`cloudfront <cli:aws cloudfront>` ]

.. _cli:aws cloudfront get-public-key-config:


*********************
get-public-key-config
*********************



===========
Description
===========



Return public key configuration informaation



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/cloudfront-2018-06-18/GetPublicKeyConfig>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    get-public-key-config
  --id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--id`` (string)


  Request the ID for the public key configuration.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


======
Output
======

PublicKeyConfig -> (structure)

  

  Return the result for the public key configuration.

  

  CallerReference -> (string)

    

    A unique number that ensures the request can't be replayed.

    

    

  Name -> (string)

    

    The name for a public key you add to CloudFront to use with features like field-level encryption.

    

    

  EncodedKey -> (string)

    

    The encoded public key that you want to add to CloudFront to use with features like field-level encryption.

    

    

  Comment -> (string)

    

    An optional comment about a public key.

    

    

  

ETag -> (string)

  

  The current version of the public key configuration. For example: ``E2QWRUHAPOMQZL`` .

  

  

