[ :ref:`aws <cli:aws>` . :ref:`cloud9 <cli:aws cloud9>` ]

.. _cli:aws cloud9 create-environment-membership:


*****************************
create-environment-membership
*****************************



===========
Description
===========



Adds an environment member to an AWS Cloud9 development environment.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/cloud9-2017-09-23/CreateEnvironmentMembership>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    create-environment-membership
  --environment-id <value>
  --user-arn <value>
  --permissions <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--environment-id`` (string)


  The ID of the environment that contains the environment member you want to add.

  

``--user-arn`` (string)


  The Amazon Resource Name (ARN) of the environment member you want to add.

  

``--permissions`` (string)


  The type of environment member permissions you want to associate with this environment member. Available values include:

   

   
  * ``read-only`` : Has read-only access to the environment. 
   
  * ``read-write`` : Has read-write access to the environment. 
   

  

  Possible values:

  
  *   ``read-write``

  
  *   ``read-only``

  

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To add an environment member to an AWS Cloud9 development environment**

This example adds the specified environment member to the specified AWS Cloud9 development environment.

Command::

  aws cloud9 create-environment-membership --environment-id 8a34f51ce1e04a08882f1e811bd706EX --user-arn arn:aws:iam::123456789012:user/AnotherDemoUser --permissions read-write

Output::

  {
    "membership": {
      "environmentId": "8a34f51ce1e04a08882f1e811bd706EX",
      "userId": "AIDAJ3LOROMOUXTBSU6EX",
      "userArn": "arn:aws:iam::123456789012:user/AnotherDemoUser",
      "permissions": "read-write"
    }
  }

======
Output
======

membership -> (structure)

  

  Information about the environment member that was added.

  

  permissions -> (string)

    

    The type of environment member permissions associated with this environment member. Available values include:

     

     
    * ``owner`` : Owns the environment. 
     
    * ``read-only`` : Has read-only access to the environment. 
     
    * ``read-write`` : Has read-write access to the environment. 
     

    

    

  userId -> (string)

    

    The user ID in AWS Identity and Access Management (AWS IAM) of the environment member.

    

    

  userArn -> (string)

    

    The Amazon Resource Name (ARN) of the environment member.

    

    

  environmentId -> (string)

    

    The ID of the environment for the environment member.

    

    

  lastAccess -> (timestamp)

    

    The time, expressed in epoch time format, when the environment member last opened the environment.

    

    

  

