[ :ref:`aws <cli:aws>` . :ref:`alexaforbusiness <cli:aws alexaforbusiness>` ]

.. _cli:aws alexaforbusiness associate-contact-with-address-book:


***********************************
associate-contact-with-address-book
***********************************



===========
Description
===========



Associates a contact with a given address book.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/alexaforbusiness-2017-11-09/AssociateContactWithAddressBook>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    associate-contact-with-address-book
  --contact-arn <value>
  --address-book-arn <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--contact-arn`` (string)


  The ARN of the contact to associate with an address book.

  

``--address-book-arn`` (string)


  The ARN of the address book with which to associate the contact.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


======
Output
======

