[ :ref:`aws <cli:aws>` . :ref:`workmail <cli:aws workmail>` ]

.. _cli:aws workmail associate-delegate-to-resource:


******************************
associate-delegate-to-resource
******************************



===========
Description
===========



Adds a member to the resource's set of delegates.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/workmail-2017-10-01/AssociateDelegateToResource>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    associate-delegate-to-resource
  --organization-id <value>
  --resource-id <value>
  --entity-id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--organization-id`` (string)


  The organization under which the resource exists.

  

``--resource-id`` (string)


  The resource for which members are associated.

  

``--entity-id`` (string)


  The member (user or group) to associate to the resource.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To add a delegate to a resource**

This example adds a delegate to a resource.

Command::

  aws workmail associate-delegate-to-resource --organization-id m-d281d0a2fd824be5b6cd3d3ce909fd27 --resource-id r-68bf2d3b1c0244aab7264c24b9217443 --entity-id S-1-1-11-1111111111-2222222222-3333333333-3333

Output::

  None

======
Output
======

