[ :ref:`aws <cli:aws>` . :ref:`workmail <cli:aws workmail>` ]

.. _cli:aws workmail create-resource:


***************
create-resource
***************



===========
Description
===========



Creates a new Amazon WorkMail resource. The available types are equipment and room.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/workmail-2017-10-01/CreateResource>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    create-resource
  --organization-id <value>
  --name <value>
  --type <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--organization-id`` (string)


  The identifier associated with the organization for which the resource is created.

  

``--name`` (string)


  The name of the created resource.

  

``--type`` (string)


  The type of the created resource.

  

  Possible values:

  
  *   ``ROOM``

  
  *   ``EQUIPMENT``

  

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To create a new resource**

This example creates a new resource (meeting room) for the specified organization.

Command::

  aws workmail create-resource --organization-id m-d281d0a2fd824be5b6cd3d3ce909fd27 --name exampleRoom1 --type ROOM

Output::

  {
    "ResourceId": "r-7afe0efbade843a58cdc10251fce992c"
  }

======
Output
======

ResourceId -> (string)

  

  The identifier of the created resource.

  

  

