[ :ref:`aws <cli:aws>` . :ref:`workmail <cli:aws workmail>` ]

.. _cli:aws workmail create-user:


***********
create-user
***********



===========
Description
===========



Creates a user who can be used in Amazon WorkMail by calling the RegisterToWorkMail operation.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/workmail-2017-10-01/CreateUser>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    create-user
  --organization-id <value>
  --name <value>
  --display-name <value>
  --password <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--organization-id`` (string)


  The identifier of the organization for which the user is created.

  

``--name`` (string)


  The name for the user to be created.

  

``--display-name`` (string)


  The display name for the user to be created.

  

``--password`` (string)


  The password for the user to be created.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To create a new user**

This example creates a new user.

Command::

  aws workmail create-user --organization-id m-d281d0a2fd824be5b6cd3d3ce909fd27 --name exampleName --display-name exampleDisplayName --password examplePa$$w0rd

Output::

  {
    "UserId": "S-1-1-11-1111111111-2222222222-3333333333-3333"
  }

======
Output
======

UserId -> (string)

  

  The information regarding the newly created user.

  

  

