[ :ref:`aws <cli:aws>` . :ref:`workmail <cli:aws workmail>` ]

.. _cli:aws workmail describe-user:


*************
describe-user
*************



===========
Description
===========



Provides information regarding the user.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/workmail-2017-10-01/DescribeUser>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    describe-user
  --organization-id <value>
  --user-id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--organization-id`` (string)


  The identifier for the organization under which the user exists.

  

``--user-id`` (string)


  The identifier for the user to be described.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To retrieve user information**

This example retrieves information for a specified user.

Command::

  aws workmail describe-user --organization-id m-d281d0a2fd824be5b6cd3d3ce909fd27 --user-id S-1-1-11-1111111111-2222222222-3333333333-3333

Output::

  {
    "UserId": "S-1-1-11-1111111111-2222222222-3333333333-3333",
    "Name": "exampleUser1",
    "Email": "exampleUser1@site.awsapps.com",
    "DisplayName": "",
    "State": "ENABLED",
    "UserRole": "USER",
    "EnabledDate": 1532459261.827
  }

======
Output
======

UserId -> (string)

  

  The identifier for the described user.

  

  

Name -> (string)

  

  The name for the user.

  

  

Email -> (string)

  

  The email of the user.

  

  

DisplayName -> (string)

  

  The display name of the user.

  

  

State -> (string)

  

  The state of a user: enabled (registered to Amazon WorkMail) or disabled (deregistered or never registered to Amazon WorkMail).

  

  

UserRole -> (string)

  

  In certain cases other entities are modeled as users. If interoperability is enabled, resources are imported into Amazon WorkMail as users. Because different Amazon WorkMail organizations rely on different directory types, administrators can distinguish between a user that is not registered to Amazon WorkMail (is disabled and has a user role) and the administrative users of the directory. The values are USER, RESOURCE, and SYSTEM_USER.

  

  

EnabledDate -> (timestamp)

  

  The date and time at which the user was enabled for Amazon WorkMail usage, in UNIX epoch time format.

  

  

DisabledDate -> (timestamp)

  

  The date and time at which the user was disabled for Amazon WorkMail usage, in UNIX epoch time format.

  

  

