[ :ref:`aws <cli:aws>` . :ref:`workmail <cli:aws workmail>` ]

.. _cli:aws workmail describe-group:


**************
describe-group
**************



===========
Description
===========



Returns the data available for the group.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/workmail-2017-10-01/DescribeGroup>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    describe-group
  --organization-id <value>
  --group-id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--organization-id`` (string)


  The identifier for the organization under which the group exists.

  

``--group-id`` (string)


  The identifier for the group to be described.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To retrieve information for a group**

This example retrieves information for the specified group.

Command::

  aws workmail describe-group --organization-id m-d281d0a2fd824be5b6cd3d3ce909fd27 --group-id S-1-1-11-1122222222-2222233333-3333334444-4444

Output::

  {
    "GroupId": "S-1-1-11-1122222222-2222233333-3333334444-4444",
    "Name": "exampleGroup1",
    "State": "ENABLED"
  }

======
Output
======

GroupId -> (string)

  

  The identifier of the described group.

  

  

Name -> (string)

  

  The name of the described group.

  

  

Email -> (string)

  

  The email of the described group.

  

  

State -> (string)

  

  The state of the user: enabled (registered to Amazon WorkMail) or disabled (deregistered or never registered to Amazon WorkMail).

  

  

EnabledDate -> (timestamp)

  

  The date and time when a user was registered to Amazon WorkMail, in UNIX epoch time format.

  

  

DisabledDate -> (timestamp)

  

  The date and time when a user was deregistered from Amazon WorkMail, in UNIX epoch time format.

  

  

