[ :ref:`aws <cli:aws>` . :ref:`workmail <cli:aws workmail>` ]

.. _cli:aws workmail disassociate-delegate-from-resource:


***********************************
disassociate-delegate-from-resource
***********************************



===========
Description
===========



Removes a member from the resource's set of delegates.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/workmail-2017-10-01/DisassociateDelegateFromResource>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    disassociate-delegate-from-resource
  --organization-id <value>
  --resource-id <value>
  --entity-id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--organization-id`` (string)


  The identifier for the organization under which the resource exists.

  

``--resource-id`` (string)


  The identifier of the resource from which delegates' set members are removed. 

  

``--entity-id`` (string)


  The identifier for the member (user, group) to be removed from the resource's delegates.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To remove a member from a resource**

This example removes the specified member from a resource.

Command::

  aws workmail disassociate-delegate-from-resource --organization-id m-d281d0a2fd824be5b6cd3d3ce909fd27 --resource-id r-68bf2d3b1c0244aab7264c24b9217443 --entity-id S-1-1-11-1111111111-2222222222-3333333333-3333

Output::

  None

======
Output
======

