[ :ref:`aws <cli:aws>` . :ref:`workmail <cli:aws workmail>` ]

.. _cli:aws workmail list-mailbox-permissions:


************************
list-mailbox-permissions
************************



===========
Description
===========



Lists the mailbox permissions associated with a mailbox.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/workmail-2017-10-01/ListMailboxPermissions>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    list-mailbox-permissions
  --organization-id <value>
  --entity-id <value>
  [--next-token <value>]
  [--max-results <value>]
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--organization-id`` (string)


  The identifier of the organization under which the entity (user or group) exists.

  

``--entity-id`` (string)


  The identifier of the entity (user or group) for which to list mailbox permissions.

  

``--next-token`` (string)


  The token to use to retrieve the next page of results. The first call does not contain any tokens.

  

``--max-results`` (integer)


  The maximum number of results to return in a single call.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To retrieve a list of mailbox permissions**

This example retrieves the mailbox permissions associated with the specified entity's mailbox.

Command::

  aws workmail list-mailbox-permissions --organization-id m-d281d0a2fd824be5b6cd3d3ce909fd27 --entity-id S-1-1-11-1111111111-2222222222-3333333333-3333 

Output::

  {
    "Permissions": [
        {
            "GranteeId": "S-1-1-11-1122222222-2222233333-3333334444-4444",
            "GranteeType": "USER",
            "PermissionValues": [
                "FULL_ACCESS"
            ]
        }
    ]
  }

======
Output
======

Permissions -> (list)

  

  One page of the entity's mailbox permissions.

  

  (structure)

    

    Permission granted to an entity (user, group) to access a certain aspect of another entity's mailbox.

    

    GranteeId -> (string)

      

      The identifier of the entity (user or group) to which the permissions are granted.

      

      

    GranteeType -> (string)

      

      The type of entity (user, group) of the entity referred to in GranteeId.

      

      

    PermissionValues -> (list)

      

      The permissions granted to the grantee. SEND_AS allows the grantee to send email as the owner of the mailbox (the grantee is not mentioned on these emails). SEND_ON_BEHALF allows the grantee to send email on behalf of the owner of the mailbox (the grantee is not mentioned as the physical sender of these emails). FULL_ACCESS allows the grantee full access to the mailbox, irrespective of other folder-level permissions set on the mailbox.

      

      (string)

        

        

      

    

  

NextToken -> (string)

  

  The token to use to retrieve the next page of results. The value is "null" when there are no more results to return.

  

  

