[ :ref:`aws <cli:aws>` . :ref:`workmail <cli:aws workmail>` ]

.. _cli:aws workmail list-resource-delegates:


***********************
list-resource-delegates
***********************



===========
Description
===========



Lists the delegates associated with a resource. Users and groups can be resource delegates and answer requests on behalf of the resource.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/workmail-2017-10-01/ListResourceDelegates>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    list-resource-delegates
  --organization-id <value>
  --resource-id <value>
  [--next-token <value>]
  [--max-results <value>]
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--organization-id`` (string)


  The identifier for the organization that contains the resource for which delegates are listed.

  

``--resource-id`` (string)


  The identifier for the resource whose delegates are listed.

  

``--next-token`` (string)


  The token used to paginate through the delegates associated with a resource.

  

``--max-results`` (integer)


  The number of maximum results in a page.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To list the delegates for a resource**

This example retrieves the delegates associated with a specified resource.

Command::

  aws workmail list-resource-delegates --organization-id m-d281d0a2fd824be5b6cd3d3ce909fd27 --resource-id r-68bf2d3b1c0244aab7264c24b9217443 

Output::

  {
    "Delegates": [
        {
            "Id": "S-1-1-11-1111111111-2222222222-3333333333-3333",
            "Type": "USER"
        }
    ]
  }

======
Output
======

Delegates -> (list)

  

  One page of the resource's delegates.

  

  (structure)

    

    The name of the attribute, which is one of the values defined in the UserAttribute enumeration.

    

    Id -> (string)

      

      The identifier for the user or group is associated as the resource's delegate.

      

      

    Type -> (string)

      

      The type of the delegate: user or group.

      

      

    

  

NextToken -> (string)

  

  The token used to paginate through the delegates associated with a resource. While results are still available, it has an associated value. When the last page is reached, the token is empty. 

  

  

