[ :ref:`aws <cli:aws>` . :ref:`workmail <cli:aws workmail>` ]

.. _cli:aws workmail reset-password:


**************
reset-password
**************



===========
Description
===========



Allows the administrator to reset the password for a user.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/workmail-2017-10-01/ResetPassword>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    reset-password
  --organization-id <value>
  --user-id <value>
  --password <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--organization-id`` (string)


  The identifier of the organization that contains the user for which the password is reset.

  

``--user-id`` (string)


  The identifier of the user for whom the password is reset.

  

``--password`` (string)


  The new password for the user.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To reset a password**

This example resets the password for the specified user.

Command::

  aws workmail reset-password --organization-id m-d281d0a2fd824be5b6cd3d3ce909fd27 --user-id S-1-1-11-1111111111-2222222222-3333333333-3333 --password examplePa$$w0rd

Output::

  None

======
Output
======

