[ :ref:`aws <cli:aws>` . :ref:`secretsmanager <cli:aws secretsmanager>` ]

.. _cli:aws secretsmanager delete-resource-policy:


**********************
delete-resource-policy
**********************



===========
Description
===========



Deletes the resource-based permission policy that's attached to the secret.

 

 **Minimum permissions**  

 

To run this command, you must have the following permissions:

 

 
* secretsmanager:DeleteResourcePolicy 
 

 

 **Related operations**  

 

 
* To attach a resource policy to a secret, use  PutResourcePolicy . 
 
* To retrieve the current resource-based policy that's attached to a secret, use  GetResourcePolicy . 
 
* To list all of the currently available secrets, use  ListSecrets . 
 



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/secretsmanager-2017-10-17/DeleteResourcePolicy>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    delete-resource-policy
  --secret-id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--secret-id`` (string)


  Specifies the secret that you want to delete the attached resource-based policy for. You can specify either the Amazon Resource Name (ARN) or the friendly name of the secret.

   

  .. note::

     

    If you specify an ARN, we generally recommend that you specify a complete ARN. You can specify a partial ARN too—for example, if you don’t include the final hyphen and six random characters that Secrets Manager adds at the end of the ARN when you created the secret. A partial ARN match can work as long as it uniquely matches only one secret. However, if your secret has a name that ends in a hyphen followed by six characters (before Secrets Manager adds the hyphen and six characters to the ARN) and you try to use that as a partial ARN, then those characters cause Secrets Manager to assume that you’re specifying a complete ARN. This confusion can cause unexpected results. To avoid this situation, we recommend that you don’t create secret names that end with a hyphen followed by six characters.

     

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Examples
========

**To delete the resource-based policy attached to a secret**

The following example shows how to delete the resource-based policy that is attached to a secret. For more information, see `Resource-based Policies` in the *Secrets Manager User Guide*.
.. _`Resource-based Policies`: http://docs.aws.amazon.com/secretsmanager/latest/userguide/auth-and-access_overview.html#auth-and-access_resource-policies::

  aws secretsmanager delete-resource-policy --secret-id MyTestDatabaseSecret

The output shows the following. ::

  {
      "ARN": "arn:aws:secretsmanager:us-west-2:123456789012:secret:MyTestDatabaseMasterSecret-a1b2c3",
      "Name": "MyTestDatabaseSecret"
  }

======
Output
======

ARN -> (string)

  

  The ARN of the secret that the resource-based policy was deleted for.

  

  

Name -> (string)

  

  The friendly name of the secret that the resource-based policy was deleted for.

  

  

