[ :ref:`aws <cli:aws>` . :ref:`kinesis <cli:aws kinesis>` ]

.. _cli:aws kinesis stop-stream-encryption:


**********************
stop-stream-encryption
**********************



===========
Description
===========



Disables server-side encryption for a specified stream. 

 

Stopping encryption is an asynchronous operation. Upon receiving the request, Kinesis Data Streams returns immediately and sets the status of the stream to ``UPDATING`` . After the update is complete, Kinesis Data Streams sets the status of the stream back to ``ACTIVE`` . Stopping encryption normally takes a few seconds to complete, but it can take minutes. You can continue to read and write data to your stream while its status is ``UPDATING`` . Once the status of the stream is ``ACTIVE`` , records written to the stream are no longer encrypted by Kinesis Data Streams. 

 

API Limits: You can successfully disable server-side encryption 25 times in a rolling 24-hour period. 

 

Note: It can take up to 5 seconds after the stream is in an ``ACTIVE`` status before all records written to the stream are no longer subject to encryption. After you disabled encryption, you can verify that encryption is not applied by inspecting the API response from ``PutRecord`` or ``PutRecords`` .



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/kinesis-2013-12-02/StopStreamEncryption>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    stop-stream-encryption
  --stream-name <value>
  --encryption-type <value>
  --key-id <value>
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--stream-name`` (string)


  The name of the stream on which to stop encrypting records.

  

``--encryption-type`` (string)


  The encryption type. The only valid value is ``KMS`` .

  

  Possible values:

  
  *   ``NONE``

  
  *   ``KMS``

  

  

``--key-id`` (string)


  The GUID for the customer-managed AWS KMS key to use for encryption. This value can be a globally unique identifier, a fully specified Amazon Resource Name (ARN) to either an alias or a key, or an alias name prefixed by "alias/".You can also use a master key owned by Kinesis Data Streams by specifying the alias ``aws/kinesis`` .

   

   
  * Key ARN example: ``arn:aws:kms:us-east-1:123456789012:key/12345678-1234-1234-1234-123456789012``   
   
  * Alias ARN example: ``arn:aws:kms:us-east-1:123456789012:alias/MyAliasName``   
   
  * Globally unique key ID example: ``12345678-1234-1234-1234-123456789012``   
   
  * Alias name example: ``alias/MyAliasName``   
   
  * Master key owned by Kinesis Data Streams: ``alias/aws/kinesis``   
   

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


======
Output
======

None