[ :ref:`aws <cli:aws>` . :ref:`workspaces <cli:aws workspaces>` ]

.. _cli:aws workspaces describe-ip-groups:


******************
describe-ip-groups
******************



===========
Description
===========



Describes one or more of your IP access control groups.



See also: `AWS API Documentation <https://docs.aws.amazon.com/goto/WebAPI/workspaces-2015-04-08/DescribeIpGroups>`_

See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


========
Synopsis
========

::

    describe-ip-groups
  [--group-ids <value>]
  [--next-token <value>]
  [--max-results <value>]
  [--cli-input-json <value>]
  [--generate-cli-skeleton <value>]




=======
Options
=======

``--group-ids`` (list)


  The IDs of one or more IP access control groups.

  



Syntax::

  "string" "string" ...



``--next-token`` (string)


  The token for the next set of results. (You received this token from a previous call.)

  

``--max-results`` (integer)


  The maximum number of items to return.

  

``--cli-input-json`` (string)
Performs service operation based on the JSON string provided. The JSON string follows the format provided by ``--generate-cli-skeleton``. If other arguments are provided on the command line, the CLI values will override the JSON-provided values. It is not possible to pass arbitrary binary values using a JSON-provided value as the string will be taken literally.

``--generate-cli-skeleton`` (string)
Prints a JSON skeleton to standard output without sending an API request. If provided with no value or the value ``input``, prints a sample input JSON that can be used as an argument for ``--cli-input-json``. If provided with the value ``output``, it validates the command inputs and returns a sample output JSON for that command.


See :doc:`'aws help' </reference/index>` for descriptions of global parameters.


======
Output
======

Result -> (list)

  

  Information about the IP access control groups.

  

  (structure)

    

    Information about an IP access control group.

    

    groupId -> (string)

      

      The ID of the group.

      

      

    groupName -> (string)

      

      The name of the group.

      

      

    groupDesc -> (string)

      

      The description of the group.

      

      

    userRules -> (list)

      

      The rules.

      

      (structure)

        

        Information about a rule for an IP access control group.

        

        ipRule -> (string)

          

          The IP address range, in CIDR notation.

          

          

        ruleDesc -> (string)

          

          The description.

          

          

        

      

    

  

NextToken -> (string)

  

  The token to use to retrieve the next set of results, or null if there are no more results available. This token is valid for one day and must be used within that time frame.

  

  

